VV_cases/V1_solver/results/study_v1/runs/005_data_v1_production_like_short/simulations/b0375_prod_Re135/openfoam_setup/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.170570539 0.000170571 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        name            poiseuilleInlet;
        value           uniform (0 0 0);
        code
        #{
            vectorField v(this->patch().size(), vector::zero);
            const vectorField& cf = this->patch().Cf();
            forAll(v, i)
            {
                const scalar y = cf[i].y();
                v[i].x() = 0.170570539*(1.0 - sqr(y/0.016000000));
            }
            operator==(v);
        #};
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.170570539 0 0);
    }
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
    }
    cylinder
    {
        type            noSlip;
    }
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
}
