VV_cases/V1_solver/results/study_v1/runs/005_data_v1_production_like_short/simulations/b0375_prod_Re135/openfoam_setup/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet { type calculated; value $internalField; }
    outlet { type calculated; value $internalField; }
    bottom { type calculated; value $internalField; }
    top { type calculated; value $internalField; }
    cylinder { type calculated; value $internalField; }
    front { type symmetryPlane; }
    back { type symmetryPlane; }
}
