VV_cases/V1_solver/results/study_v1/runs/005_data_v1_production_like_short/simulations/b0375_prod_Re135/openfoam_setup/system/snappyHexMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    cylinder
    {
        type    searchableCylinder;
        point1  (0 0 -0.006000);
        point2  (0 0  0.006000);
        radius  0.006000;
    }

    nearCylinder
    {
        type searchableBox;
        min (-0.024000 -0.012000 -0.006000);
        max (0.036000  0.012000  0.006000);
    }

    wakeBox
    {
        type searchableBox;
        min (0.000000 -0.014000 -0.006000);
        max (0.084000  0.014000  0.006000);
    }
}

castellatedMeshControls
{
    maxLocalCells           800000;
    maxGlobalCells          3000000;
    minRefinementCells      0;
    maxLoadUnbalance        0.10;
    nCellsBetweenLevels     3;
    resolveFeatureAngle     30;
    features ();

    refinementSurfaces
    {
        cylinder
        {
            level   (2 2);
            patchInfo
            {
                type wall;
            }
        }
    }

    refinementRegions
    {
        nearCylinder
        {
            mode    inside;
            levels  ((1e15 1));
        }
        wakeBox
        {
            mode    inside;
            levels  ((1e15 0));
        }
    }

    locationInMesh (-0.030 0 0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        5;
    tolerance           2.0;
    nSolveIter          100;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-30;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.02;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;

    relaxed
    {
        maxNonOrtho     75;
    }
}

writeFlags ( scalarLevels );
mergeTolerance 1e-6;
